`use strict`;

$(() => {
  $('button').click(() => {
    let ei = $("#input2");
    let eo = $("#output");
    let text = ei.val();
    eo.empty();

    // console.log("文字数：", text.length)

    for (let i = 0; i < text.length; i++) {
      let c = text.substr(i, 1);
      let d = text.substr(i + 1, 1);
      let klass = [], year;

      if (c === "\n") {
        $("<span class='newline'/>").appendTo(eo);
        continue;
      }

      if (isKanji(c)) {
        klass.push("kanji");

        if (year = getYearOfKyoikuKanji(c))
          klass.push("joyo kyoiku y" + year);

        if (isJoyoKanji(c))
          klass.push("joyo");

        // if (isJinmeiKanji(c))
        //   klass.push("jinmei");

        if (isJitaiKakunin(c))
          klass.push("jitai");

        if (isDaijisen(c))
          klass.push("daijisen");

        // if (isSurrogate(c))
        //   klass.push("surrogate");

        // 「𠮟」の対応
        if (c === "\uD842" && d === "\uDF9F")
          klass.push("joyo shikaru");

        // 「𨦇𩜙卉兔眞𠮷𥡴𨻶」の対応
        if (c === "\uD862" && d === "\uDD87") klass.push("salomoji");
        if (c === "\uD865" && d === "\uDF19") klass.push("salomoji");
        if (c === "\uD87E" && d === "\uDC2C") klass.push("salomoji");
        if (c === "\uD87E" && d === "\uDC0F") klass.push("salomoji");
        if (c === "\uD87E" && d === "\uDD45") klass.push("joyo salomoji");
        if (c === "\uD842" && d === "\uDFB7") klass.push("joyo salomoji");
        if (c === "\uD856" && d === "\uDC74") klass.push("joyo salomoji");
        if (c === "\uD863" && d === "\uDEF6") klass.push("joyo salomoji");

        if (isItaijiSelector(d))
          klass.push("itaiji");

      }

      $("<span/>")
        .text(c).addClass(klass.join(" ")).appendTo(eo);

    };

    function isKanji(c) {
      return /^[\u2E80-\u2EF3\u2F00-\u2FD5\u3400-\u9FFF\uD800-\uDFFF\uF900-\uFAEF]+$/.test(c);
      // return /^[\u2E80-\u2EF3\u2F00-\u2FD5\u3400-\u9FFF\uD800-\uDFFF\uF900-\uFAEF\u20000-\u2FA1F\u30000-\u323AF\uE0100-\uE01EF]+$/.test(c);
      // 上の行の\u****は、4桁しかだめ。\u{****}での表記が可能になれば使える。

      // console.log(/^[\u{0061}]+$/.test(c));
    }

    // 常用漢字表から「𠮟」を除き「叱」を入れる
    function isJoyoKanji(c) {
      return /^[亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育一壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科架夏家荷華菓貨渦過嫁暇禍靴寡歌箇稼課蚊牙瓦我画芽賀雅餓介回灰会快戒改怪拐悔海界皆械絵開階塊楷解潰壊懐諧貝外劾害崖涯街慨蓋該概骸垣柿各角拡革格核殻郭覚較隔閣確獲嚇穫学岳楽額顎掛潟括活喝渇割葛滑褐轄且株釜鎌刈干刊甘汗缶完肝官冠巻看陥乾勘患貫寒喚堪換敢棺款間閑勧寛幹感漢慣管関歓監緩憾還館環簡観韓艦鑑丸含岸岩玩眼頑顔願企伎危机気岐希忌汽奇祈季紀軌既記起飢鬼帰基寄規亀喜幾揮期棋貴棄毀旗器畿輝機騎技宜偽欺義疑儀戯擬犠議菊吉喫詰却客脚逆虐九久及弓丘旧休吸朽臼求究泣急級糾宮救球給嗅窮牛去巨居拒拠挙虚許距魚御漁凶共叫狂京享供協況峡挟狭恐恭胸脅強教郷境橋矯鏡競響驚仰暁業凝曲局極玉巾斤均近金菌勤琴筋僅禁緊錦謹襟吟銀区句苦駆具惧愚空偶遇隅串屈掘窟熊繰君訓勲薫軍郡群兄刑形系径茎係型契計恵啓掲渓経蛍敬景軽傾携継詣慶憬稽憩警鶏芸迎鯨隙劇撃激桁欠穴血決結傑潔月犬件見券肩建研県倹兼剣拳軒健険圏堅検嫌献絹遣権憲賢謙鍵繭顕験懸元幻玄言弦限原現舷減源厳己戸古呼固股虎孤弧故枯個庫湖雇誇鼓錮顧五互午呉後娯悟碁語誤護口工公勾孔功巧広甲交光向后好江考行坑孝抗攻更効幸拘肯侯厚恒洪皇紅荒郊香候校耕航貢降高康控梗黄喉慌港硬絞項溝鉱構綱酵稿興衡鋼講購乞号合拷剛傲豪克告谷刻国黒穀酷獄骨駒込頃今困昆恨根婚混痕紺魂墾懇左佐沙査砂唆差詐鎖座挫才再災妻采砕宰栽彩採済祭斎細菜最裁債催塞歳載際埼在材剤財罪崎作削昨柵索策酢搾錯咲冊札刷刹拶殺察撮擦雑皿三山参桟蚕惨産傘散算酸賛残斬暫士子支止氏仕史司四市矢旨死糸至伺志私使刺始姉枝祉肢姿思指施師恣紙脂視紫詞歯嗣試詩資飼誌雌摯賜諮示字寺次耳自似児事侍治持時滋慈辞磁餌璽鹿式識軸七失室疾執湿嫉漆質実芝写社車舎者射捨赦斜煮遮謝邪蛇尺借酌釈爵若弱寂手主守朱取狩首殊珠酒腫種趣寿受呪授需儒樹収囚州舟秀周宗拾秋臭修袖終羞習週就衆集愁酬醜蹴襲十汁充住柔重従渋銃獣縦叔祝宿淑粛縮塾熟出述術俊春瞬旬巡盾准殉純循順準潤遵処初所書庶暑署緒諸女如助序叙徐除小升少召匠床抄肖尚招承昇松沼昭宵将消症祥称笑唱商渉章紹訟勝掌晶焼焦硝粧詔証象傷奨照詳彰障憧衝賞償礁鐘上丈冗条状乗城浄剰常情場畳蒸縄壌嬢錠譲醸色拭食植殖飾触嘱織職辱尻心申伸臣芯身辛侵信津神唇娠振浸真針深紳進森診寝慎新審震薪親人刃仁尽迅甚陣尋腎須図水吹垂炊帥粋衰推酔遂睡穂随髄枢崇数据杉裾寸瀬是井世正生成西声制姓征性青斉政星牲省凄逝清盛婿晴勢聖誠精製誓静請整醒税夕斥石赤昔析席脊隻惜戚責跡積績籍切折拙窃接設雪摂節説舌絶千川仙占先宣専泉浅洗染扇栓旋船戦煎羨腺詮践箋銭潜線遷選薦繊鮮全前善然禅漸膳繕狙阻祖租素措粗組疎訴塑遡礎双壮早争走奏相荘草送倉捜挿桑巣掃曹曽爽窓創喪痩葬装僧想層総遭槽踪操燥霜騒藻造像増憎蔵贈臓即束足促則息捉速側測俗族属賊続卒率存村孫尊損遜他多汰打妥唾堕惰駄太対体耐待怠胎退帯泰堆袋逮替貸隊滞態戴大代台第題滝宅択沢卓拓託濯諾濁但達脱奪棚誰丹旦担単炭胆探淡短嘆端綻誕鍛団男段断弾暖談壇地池知値恥致遅痴稚置緻竹畜逐蓄築秩窒茶着嫡中仲虫沖宙忠抽注昼柱衷酎鋳駐著貯丁弔庁兆町長挑帳張彫眺釣頂鳥朝貼超腸跳徴嘲潮澄調聴懲直勅捗沈珍朕陳賃鎮追椎墜通痛塚漬坪爪鶴低呈廷弟定底抵邸亭貞帝訂庭逓停偵堤提程艇締諦泥的笛摘滴適敵溺迭哲鉄徹撤天典店点展添転塡田伝殿電斗吐妬徒途都渡塗賭土奴努度怒刀冬灯当投豆東到逃倒凍唐島桃討透党悼盗陶塔搭棟湯痘登答等筒統稲踏糖頭謄藤闘騰同洞胴動堂童道働銅導瞳峠匿特得督徳篤毒独読栃凸突届屯豚頓貪鈍曇丼那奈内梨謎鍋南軟難二尼弐匂肉虹日入乳尿任妊忍認寧熱年念捻粘燃悩納能脳農濃把波派破覇馬婆罵拝杯背肺俳配排敗廃輩売倍梅培陪媒買賠白伯拍泊迫剝舶博薄麦漠縛爆箱箸畑肌八鉢発髪伐抜罰閥反半氾犯帆汎伴判坂阪板版班畔般販斑飯搬煩頒範繁藩晩番蛮盤比皮妃否批彼披肥非卑飛疲秘被悲扉費碑罷避尾眉美備微鼻膝肘匹必泌筆姫百氷表俵票評漂標苗秒病描猫品浜貧賓頻敏瓶不夫父付布扶府怖阜附訃負赴浮婦符富普腐敷膚賦譜侮武部舞封風伏服副幅復福腹複覆払沸仏物粉紛雰噴墳憤奮分文聞丙平兵併並柄陛閉塀幣弊蔽餅米壁璧癖別蔑片辺返変偏遍編弁便勉歩保哺捕補舗母募墓慕暮簿方包芳邦奉宝抱放法泡胞俸倣峰砲崩訪報蜂豊飽褒縫亡乏忙坊妨忘防房肪某冒剖紡望傍帽棒貿貌暴膨謀頰北木朴牧睦僕墨撲没勃堀本奔翻凡盆麻摩磨魔毎妹枚昧埋幕膜枕又末抹万満慢漫未味魅岬密蜜脈妙民眠矛務無夢霧娘名命明迷冥盟銘鳴滅免面綿麺茂模毛妄盲耗猛網目黙門紋問冶夜野弥厄役約訳薬躍闇由油喩愉諭輸癒唯友有勇幽悠郵湧猶裕遊雄誘憂融優与予余誉預幼用羊妖洋要容庸揚揺葉陽溶腰様瘍踊窯養擁謡曜抑沃浴欲翌翼拉裸羅来雷頼絡落酪辣乱卵覧濫藍欄吏利里理痢裏履璃離陸立律慄略柳流留竜粒隆硫侶旅虜慮了両良料涼猟陵量僚領寮療瞭糧力緑林厘倫輪隣臨瑠涙累塁類令礼冷励戻例鈴零霊隷齢麗暦歴列劣烈裂恋連廉練錬呂炉賂路露老労弄郎朗浪廊楼漏籠六録麓論和話賄脇惑枠湾腕叱]+$/.test(c);
    }

    // 不使用
    function isJinmeiKanji(c) {
      return /^[丑丞乃之也亘亦亥亨亮伊伍伽佑伶侃侑倭倖偲允冴凌凜凪凱勁匡卯叡叶只吾哉啄喬嘉圭尭奎嬉孟宏宥寅峻崚嵯嵩嶺巌巳巴巽庄弘彗彦彪彬怜恕悌惟惇惣慧捷捺敦斐於旭昂昌昴晏晃晋晟晨智暉暢曙朋朔杏杜李柊柾柚栞桂桐栗梧梓梢椋椿楠楓椰楊樺榛槙槻橘檀欣欽毅毬汀汐洸洲洵浩淳渚渥滉漱澪熙燎燦燿爾猪玖玲琢琉瑛琳瑚瑞瑶瑳甫皐皓眸矩碩碧磯祐禄禎秦稀稔稜穣竣笹笙紘紗絃紬絢綺綜緋綾綸翔翠耀耶聡肇胤胡脩舜芹芙苑茄茅茉茜莞莉菫菖萌葵萩蒔蒼蓉蓮蔦蕉蕗蘭蝶衿袈裟詢誼諄諒赳輔辰迪遥遼邑郁酉醇阿隼雛霞靖鞠頌颯馨駿魁鮎鯉鯛鳩鳳鴻鵬鷹麟麿黎黛乎云些仔佃俄俠俣俱倦傭儲兎兜其凧凰函劉劫勿廿卜卿厨厩叉叢吞吻哨喧喰喋嘩嘗噌噂圃坐坦埴堰堺堵壕壬夷奄套姪姥娩宋宕寓寵尖尤屑峨巫已巷帖幌幡庇庚庵廟廻弛忽恢恰惚悉惹憐戊或戟托按挺挽掬捲捧掠揃摑摺撒撰撞播撫擢斡斧斯昏晒晦曝曳杖杭杵杷枇柑柴柘柏栖梯桶梶梁棲椀楯楚楕楢榎榊槍槌樫樋樽橙櫂櫛櫓歎此殆毘汝汲沌沓沫洛淵淀淋渾湘湊湛溢溜漕漣濡瀕灘灸灼烏焰焚煌煤煉燕燭牒牟牡牽犀狼獅珂珊琶琵瓜瓢甥畠畢疋疏瞥砦砥硯碓碗磐祇禽秤穿窄窪窺竪竺竿笈笠筈筑箕箔篇篠簞簾籾粥粟糊紐絆綴縞徽繫繡纂纏而耽肋肴腔膏臥舵芥芭苔茸荻莫菅萄菩萊菱葦萱葺葡蓑蒐蒲蒙蔭蔣蓬蔓蕎蕨蕃蕪薙蕾藁薩蘇蝦螺蟬蟹蠟袴裡裳襖訊訣註詫諏謂諺讃豹貰賑跨蹄蹟輯輿轟辻迂迄辿迦這逞逗逢遁祁鄭醐醍醬釉釘釧鋒鋸錐錆錫鍬鎧閃閏閤陀隈雀雁雫鞄鞍鞘鞭頁頗顚饗馴馳駕魯鰯鱒鱗鳶鴨鵜鷗鷲鷺鼎祷芦俐哩塙娃徠惺孜昊桔梛椛樟檎浬珈珀琥砧禾稟穹羚苺董驍麒桧祢勺匁脹銑錘禱禎祐琢渚猪遙槇堯萠穰祿檜晄巖凛亙禰亞惡爲逸榮衞謁圓緣薗應櫻奧橫溫價禍悔海壞懷樂渴卷陷寬漢氣祈器僞戲虛峽狹響曉勤謹駈勳薰惠揭鷄藝擊縣儉劍險圈檢顯驗嚴廣恆黃國黑穀碎雜祉視兒濕實社者煮壽收臭從澁獸縱祝暑署緖諸敍將祥涉燒奬條狀乘淨剩疊孃讓釀神眞寢愼盡粹醉穗瀨齊靜攝節專戰纖禪祖壯爭莊搜巢曾裝僧層瘦騷增憎藏贈臟卽帶滯瀧單嘆團彈晝鑄著廳徵聽懲鎭轉傳都嶋燈盜稻德突難拜盃賣梅髮拔繁晚卑祕碑賓敏冨侮福拂佛勉步峯墨飜每萬默埜彌藥與搖樣謠來賴覽欄龍虜凉綠淚壘類禮曆歷練鍊郞朗廊錄]+$/.test(c);
    }

    // 標準的でない字体で、単一コードの字
    function isJitaiKakunin(c) {
      return /^[勉塚鴬諌潅﨔頚妍壷昿攅懴渗侭賎筝薮鯵騨鈬畴涛梼涜迩蝿埓蛎檪臈并桝沪弯嘘躯嚢溌醗屡屏靭頴撹唖麹鹸噛掻荆鼡桧軣莱芦焔掴侠繋蝉箪顛祷蝋呑倶閠蒋鴎繍醤兔祢圓學氣絲靑蟲壓圍營衞益應櫻假價舊經險檢效鑛吿殺雜贊飼舍證條狀精稅絕祖總增屬團斷獨佛辨瓣辯豐餘歷惡醫飮驛橫溫漢館區輕硏縣號齒實寫者暑乘神眞對鐵轉都發福藥豫樣兩綠禮練嶋榮鹽覺關觀器擧徑藝缺驗參產殘兒辭祝燒繩淸靜節說淺戰爭巢續帶單傳燈德梅飯邊變滿類勞錄﨑冨羽畫會海繪樂顏歸敎戶廣黃國黑社圖數聲晴體臺晝點當讀內賣麥步每萬來薗髙埜擴卷鄕勤權嚴穀濟蠶視收從縱處署諸將專錢裝層藏臟擔著廳黨屆難腦拜晚祕竝寶譯亂覽朗册彚䇳喻篭亞爲壹逸隱銳悅謁閱緣艷歐毆奧穩禍悔壞懷慨槪殼嶽喝渴褐罐陷勸寬歡祈既龜僞戲犧據虛峽挾狹響曉謹驅勳薰莖惠揭溪螢繼鷄擊儉劍圈獻顯吳娛恆碎齋歲劑棧慘祉濕煮釋壽臭澁獸肅緖敍尙祥稱涉奬淨剩疊壤孃讓釀觸囑寢愼盡粹醉穗隨髓樞瀨齊竊攝踐潛纖禪雙壯莊搜揷曾瘦僧騷憎贈卽墮滯瀧擇澤脫膽嘆彈遲癡鑄徵聽懲敕鎭遞盜稻鬪突貳惱霸廢髮拔繁蠻卑碑姬濱賓頻敏甁侮拂倂塀餠舖襃墨沒飜免麵默彌與譽搖謠賴欄龍隆虜獵淚壘勵戾靈齡曆戀鍊爐郞廊樓灣填剥頬栅欝旣駈插鬭盃峯凉尓堯巖槇猪琢祐祿禎穰遙亙凛昻晄渚萠]+$/.test(c);
    }

// 標準的でない字体で、異体字セレクタで表示する字。使用せず
    // function isJitaiKakunin2(c) {
    //   return /^[餌󠄀遡󠄀遜󠄀謎󠄀餅󠄀逢󠄀飴󠄀迂󠄀迦󠄀祇󠄀祁󠄀榊󠄀蝕󠄀逗󠄀腿󠄀辿󠄀槌󠄀鎚󠄀辻󠄀遁󠄀禰󠄀這󠄀樋󠄀逼󠄀蓬󠄀迄󠄀鑓󠄀漣󠄁祀󠄁祓󠄂邇󠄁邁󠄁隧󠄁飫󠄁饅󠄁燵󠄂祠󠄂禊󠄄逍󠄂逞󠄃遽󠄂饉󠄂芦󠄀禱󠄁溢󠄀鰯󠄀淫󠄀噂󠄀襖󠄀晦󠄀葛󠄀鞄󠄀翰󠄀翫󠄀徽󠄀僅󠄀屑󠄀倦󠄀捲󠄀諺󠄀巷󠄀甑󠄀薩󠄀鯖󠄀錆󠄀酋󠄀薯󠄀藷󠄀哨󠄀鞘󠄀摺󠄀撰󠄀噌󠄀蛸󠄀樽󠄀歎󠄀瀦󠄀捗󠄀鄭󠄀擢󠄀溺󠄀堵󠄀屠󠄀賭󠄀瀞󠄀灘󠄀楢󠄀秤󠄀箸󠄀叛󠄀誹󠄀謬󠄀瀕󠄀蔽󠄀瞥󠄀庖󠄀鱒󠄀儲󠄀愈󠄀猷󠄀煉󠄁簾󠄀榔󠄀嗅󠄂腔󠄁珊󠄁珊󠄂脆󠄁桝󠄂]+$/.test(c);
    // }

    function isDaijisen(c) {
      return /^[屡嘘躯嚢溌醗侠倶呑掴焔箪繋蝉顛屢噓軀囊潑醱俠俱吞摑焰簞繫蟬顚]+$/.test(c);
    }

    // function isSurrogate(c) {
    //   return /^[\uD800-\uDBFF\uDC00-\uDFFF]+$/.test(c);
    // }

    function isItaijiSelector(c) {
      return /^[\uFE00-\uFE0F\uDB40]+$/.test(c);
    }

    function getYearOfKyoikuKanji(c) {
      if (/^[一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六]+$/.test(c)) { return 1; }

      else if (/^[引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電刀冬当東答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話]+$/.test(c)) { return 2; }

      else if (/^[悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和]+$/.test(c)) { return 3; }

      else if (/^[愛案以衣位茨印英栄媛塩岡億加果貨課芽賀改械害街各覚潟完官管関観願岐希季旗器機議求泣給挙漁共協鏡競極熊訓軍郡群径景芸欠結建健験固功好香候康佐差菜最埼材崎昨札刷察参産散残氏司試児治滋辞鹿失借種周祝順初松笑唱焼照城縄臣信井成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲沖兆低底的典伝徒努灯働特徳栃奈梨熱念敗梅博阪飯飛必票標不夫付府阜富副兵別辺変便包法望牧末満未民無約勇要養浴利陸良料量輪類令冷例連老労録]+$/.test(c)) { return 4; }

      else if (/^[圧囲移因永営衛易益液演応往桜可仮価河過快解格確額刊幹慣眼紀基寄規喜技義逆久旧救居許境均禁句型経潔件険検限現減故個護効厚耕航鉱構興講告混査再災妻採際在財罪殺雑酸賛士支史志枝師資飼示似識質舎謝授修述術準序招証象賞条状常情織職制性政勢精製税責績接設絶祖素総造像増則測属率損貸態団断築貯張停提程適統堂銅導得毒独任燃能破犯判版比肥非費備評貧布婦武復複仏粉編弁保墓報豊防貿暴脈務夢迷綿輸余容略留領歴]+$/.test(c)) { return 5; }

      else if (/^[胃異遺域宇映延沿恩我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴券絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除承将傷障蒸針仁垂推寸盛聖誠舌宣専泉洗染銭善奏窓創装層操蔵臓存尊退宅担探誕段暖値宙忠著庁頂腸潮賃痛敵展討党糖届難乳認納脳派拝背肺俳班晩否批秘俵腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優預幼欲翌乱卵覧裏律臨朗論]+$/.test(c)) { return 6; }
    }

  });



});