`use strict`;

{
  const wordsValue0 = ["word21","診ろ","見／観／診","word21","診れ","見／観／診","word21","診る","見／観／診","word21","診よ","見／観／診","word21","見ろ","見／観／診","word21","見れ","見／観／診","word21","見る","見／観／診","word21","見よ","見／観／診","word21","観ろ","見／観／診","word21","観れ","見／観／診","word21","観る","見／観／診","word21","観よ","見／観／診","word21","みろ","見／観／診","word21","みれ","見／観／診","word21","みる","見／観／診","word21","みよ","見／観／診","word23","訊こ","聞／訊／聴","word23","訊け","聞／訊／聴","word23","訊く","聞／訊／聴","word23","訊き","聞／訊／聴","word23","訊か","聞／訊／聴","word23","訊い","聞／訊／聴","word23","聞こ","聞／訊／聴","word23","聞け","聞／訊／聴","word23","聞く","聞／訊／聴","word23","聞き","聞／訊／聴","word23","聞か","聞／訊／聴","word23","聞い","聞／訊／聴","word23","聴こ","聞／訊／聴","word23","聴け","聞／訊／聴","word23","聴く","聞／訊／聴","word23","聴き","聞／訊／聴","word23","聴か","聞／訊／聴","word23","聴い","聞／訊／聴","word24","効こ","効／き","word24","きこ","効／き","word24","効け","効／き","word24","きけ","効／き","word24","効く","効／き","word24","きく","効／き","word24","効き","効／き","word24","きき","効／き","word24","効か","効／き","word24","きか","効／き","word24","効い","効／き","word24","きい","効／き","word34","はじめ","初め／始め／はじめ","word34","初め","初め／始め／はじめ","word34","始め","初め／始め／はじめ","word45","作る","作／造／創","word45","作ろ","作／造／創","word45","作れ","作／造／創","word45","作り","作／造／創","word45","作ら","作／造／創","word45","作っ","作／造／創","word45","造ろ","作／造／創","word45","造れ","作／造／創","word45","造る","作／造／創","word45","造り","作／造／創","word45","造ら","作／造／創","word45","造っ","作／造／創","word45","創ろ","作／造／創","word45","創れ","作／造／創","word45","創る","作／造／創","word45","創り","作／造／創","word45","創ら","作／造／創","word45","創っ","作／造／創","word45","つくろ","作／造／創","word45","つくれ","作／造／創","word45","つくる","作／造／創","word45","つくり","作／造／創","word45","つくら","作／造／創","word45","つくっ","作／造／創","word46","摂ろ","取／摂／採","word46","摂れ","取／摂／採","word46","摂る","取／摂／採","word46","摂り","取／摂／採","word46","摂ら","取／摂／採","word46","摂っ","取／摂／採","word46","取ろ","取／摂／採","word46","取れ","取／摂／採","word46","取る","取／摂／採","word46","取り","取／摂／採","word46","取ら","取／摂／採","word46","取っ","取／摂／採","word46","採ろ","取／摂／採","word46","採れ","取／摂／採","word46","採る","取／摂／採","word46","採り","取／摂／採","word46","採ら","取／摂／採","word46","採っ","取／摂／採","word46","とろ","取／摂／採","word46","とれ","取／摂／採","word46","とる","取／摂／採","word46","とり","取／摂／採","word46","とら","取／摂／採","word46","とっ","取／摂／採","word47","変え","変／替／代／換","word47","代え","変／替／代／換","word47","替え","変／替／代／換","word47","かえ","変／替／代／換","word47","換え","変／替／代／換","word48","はかろ","測／計／量","word48","はかれ","測／計／量","word48","はかる","測／計／量","word48","はかり","測／計／量","word48","はから","測／計／量","word48","はかっ","測／計／量","word48","量ろ","測／計／量","word48","量れ","測／計／量","word48","量る","測／計／量","word48","量り","測／計／量","word48","量ら","測／計／量","word48","量っ","測／計／量","word48","測ろ","測／計／量","word48","測れ","測／計／量","word48","測る","測／計／量","word48","測り","測／計／量","word48","測ら","測／計／量","word48","測っ","測／計／量","word48","計れ","測／計／量","word48","計る","測／計／量","word48","計り","測／計／量","word48","計ら","測／計／量","word48","計ろ","測／計／量","word48","計っ","測／計／量","word61","物","物／者／もの／モノ","word61","者","物／者／もの／モノ","word61","もの","物／者／もの／モノ","word61","モノ","物／者／もの／モノ","word124","かたけれ","硬／堅／固","word124","かたかろ","硬／堅／固","word124","かたかっ","硬／堅／固","word124","硬けれ","硬／堅／固","word124","硬かろ","硬／堅／固","word124","硬かっ","硬／堅／固","word124","固けれ","硬／堅／固","word124","固かろ","硬／堅／固","word124","固かっ","硬／堅／固","word124","堅けれ","硬／堅／固","word124","堅かろ","硬／堅／固","word124","堅かっ","硬／堅／固","word124","かたく","硬／堅／固","word124","かたう","硬／堅／固","word124","かたい","硬／堅／固","word124","硬く","硬／堅／固","word124","硬う","硬／堅／固","word124","固く","硬／堅／固","word124","固う","硬／堅／固","word124","堅く","硬／堅／固","word124","堅う","硬／堅／固","word124","硬い","硬／堅／固","word124","固い","硬／堅／固","word124","堅い","硬／堅／固","word125","やわらか","柔／軟","word125","軟らか","柔／軟","word125","柔らか","柔／軟"];

  const wordsValue1 = ["word1", "しにい", "しに行", "word1", "しにいき", "しに行き", "word1", "しにいく", "しに行く", "word1", "しにいけ", "しに行け", "word1", "しにいこ", "しに行こ", "word1", "しにいっ", "しに行っ", "word2", "しにく", "しに来", "word3", "してほし", "して欲し", "word4", "しすぎ", "し過ぎ", "word5", "しうる", "し得る", "word6", "しあ", "し合", "word6", "しあう", "し合う", "word6", "しあえ", "し合え", "word6", "しあお", "し合お", "word6", "しあっ", "し合っ", "word6", "しあわ", "し合わ", "word7", "しだ", "し出", "word7", "しだし", "し出し", "word7", "しださ", "し出さ", "word7", "しだせ", "し出せ", "word7", "しだそ", "し出そ", "word7", "しこま", "し込ま", "word8", "しこ", "し込", "word8", "しこむ", "し込む", "word8", "しこめ", "し込め", "word8", "しこも", "し込も", "word8", "しこん", "し込ん", "word9", "しき", "し切", "word9", "しきら", "し切ら", "word9", "しきり", "し切り", "word9", "しきる", "し切る", "word9", "しきれ", "し切れ", "word9", "しきろ", "し切ろ", "word10", "しつ", "し付", "word11", "しと", "し取", "word12", "した", "し立", "word13", "おこ", "起こ", "word14", "かえさ", "返さ", "word14", "かえし", "返し", "word14", "かえす", "返す", "word14", "かえせ", "返せ", "word14", "かえそ", "返そ", "word15", "いか", "行か", "word15", "いき", "行き", "word15", "いく", "行く", "word15", "いけ", "行け", "word15", "いこ", "行こ", "word15", "いっ", "行っ", "word16", "くる", "来る", "word16", "くれ", "来れ", "word16", "こい", "来い", "word17", "行き来", "行き来", "word18", "いい", "言い", "word18", "いう", "言う", "word18", "いえ", "言え", "word18", "いお", "言お", "word18", "いっ", "言っ", "word19", "という", "と言う", "word19", "といえ", "と言え", "word19", "といっ", "と言っ", "word19", "といい", "と言い", "word19", "といお", "と言お", "word20", "言い訳", "言い訳", "word21", "観", "見", "word21", "診", "見", "word21", "み", "見", "word22", "みつけ", "見つけ", "word23", "訊", "聞", "word23", "聴", "聞", "word23", "き", "聞", "word24", "きか", "効か", "word24", "きき", "効き", "word24", "きく", "効く", "word24", "きけ", "効け", "word24", "きこ", "効こ", "word25", "もた", "持た", "word25", "もち", "持ち", "word25", "もつ", "持つ", "word25", "もっ", "持っ", "word25", "もて", "持て", "word25", "もと", "持と", "word26", "すま", "済ま", "word26", "すみ", "済み", "word26", "すむ", "済む", "word26", "すめ", "済め", "word26", "すも", "済も", "word26", "すん", "済ん", "word27", "ない", "無い", "word27", "なう", "無う", "word27", "なかっ", "無かっ", "word27", "なかろ", "無かろ", "word27", "なく", "無く", "word27", "なけれ", "無けれ", "word28", "なに", "何", "word29", "なんの", "何の", "word30", "何人", "何人", "word31", "ほか", "他", "word32", "その他", "その他", "word33", "はじめて", "初めて", "word34", "初め", "始め", "word34", "はじめ", "始め", "word35", "はじめる", "始める", "word35", "はじめよ", "始めよ", "word35", "はじめれ", "始めれ", "word35", "はじめろ", "始めろ", "word36", "はじまる", "始まる", "word36", "はじまっ", "始まっ", "word36", "はじまら", "始まら", "word36", "はじまり", "始まり", "word36", "はじまれ", "始まれ", "word36", "はじまろ", "始まろ", "word37", "あがる", "上がる", "word37", "あがら", "上がら", "word37", "あがり", "上がり", "word37", "あがれ", "上がれ", "word37", "あがろ", "上がろ", "word37", "あがっ", "上がっ", "word38", "あげる", "上げる", "word38", "あげ", "上げ", "word38", "あげよ", "上げよ", "word38", "あげれ", "上げれ", "word38", "あげろ", "上げろ", "word39", "出来あが", "出来上が", "word39", "できあが", "出来上が", "word40", "くださ", "下さ", "word41", "おおき", "大き", "word42", "ちいさ", "小さ", "word43", "おおいに", "大いに", "word43", "おおいなる", "大いなる", "word44", "すこし", "少し", "word45", "造ら", "作ら", "word45", "造り", "作り", "word45", "造る", "作る", "word45", "造れ", "作れ", "word45", "造ろ", "作ろ", "word45", "造っ", "作っ", "word45", "創ら", "作ら", "word45", "創り", "作り", "word45", "創る", "作る", "word45", "創れ", "作れ", "word45", "創ろ", "作ろ", "word45", "創っ", "作っ", "word45", "つくら", "作ら", "word45", "つくり", "作り", "word45", "つくる", "作る", "word45", "つくれ", "作れ", "word45", "つくろ", "作ろ", "word45", "つくっ", "作っ", "word46", "摂ら", "取ら", "word46", "摂り", "取り", "word46", "摂る", "取る", "word46", "摂れ", "取れ", "word46", "摂ろ", "取ろ", "word46", "摂っ", "取っ", "word46", "採ら", "取ら", "word46", "採り", "取り", "word46", "採る", "取る", "word46", "採れ", "取れ", "word46", "採ろ", "取ろ", "word46", "採っ", "取っ", "word46", "とら", "取ら", "word46", "とり", "取り", "word46", "とる", "取る", "word46", "とれ", "取れ", "word46", "とろ", "取ろ", "word46", "とっ", "取っ", "word47", "替え", "変え", "word47", "代え", "変え", "word47", "換え", "変え", "word47", "かえ", "変え", "word48", "計ら", "測ら", "word48", "計り", "測り", "word48", "計る", "測る", "word48", "計れ", "測れ", "word48", "計ろ", "測ろ", "word48", "計っ", "測っ", "word48", "量ら", "測ら", "word48", "量り", "測り", "word48", "量る", "測る", "word48", "量れ", "測れ", "word48", "量ろ", "測ろ", "word48", "量っ", "測っ", "word48", "はから", "測ら", "word48", "はかり", "測り", "word48", "はかる", "測る", "word48", "はかれ", "測れ", "word48", "はかろ", "測ろ", "word48", "はかっ", "測っ", "word49", "判ら", "分から", "word49", "判り", "分かり", "word49", "判る", "分かる", "word49", "判れ", "分かれ", "word49", "判ろ", "分かろ", "word49", "判っ", "分かっ", "word49", "解ら", "分から", "word49", "解り", "分かり", "word49", "解る", "分かる", "word49", "解れ", "分かれ", "word49", "解ろ", "分かろ", "word49", "解っ", "分かっ", "word49", "わから", "分から", "word49", "わかり", "分かり", "word49", "わかる", "分かる", "word49", "わかれ", "分かれ", "word49", "わかろ", "分かろ", "word49", "わかっ", "分かっ", "word50", "むだ", "無駄", "word50", "ムダ", "無駄", "word51", "むり", "無理", "word51", "ムリ", "無理", "word52", "ばか", "馬鹿", "word52", "バカ", "馬鹿", "word53", "へん", "変", "word53", "ヘン", "変", "word54", "いや", "嫌", "word54", "イヤ", "嫌", "word55", "がまん", "我慢", "word55", "ガマン", "我慢", "word56", "きれい", "綺麗", "word56", "キレイ", "綺麗", "word57", "からだ", "体", "word57", "カラダ", "体", "word58", "ふしぎ", "不思議", "word58", "フシギ", "不思議", "word59", "ほんとう", "本当", "word59", "ホント", "本当", "word60", "かんたん", "簡単", "word60", "カンタン", "簡単", "word61", "者", "物", "word61", "もの", "物", "word61", "モノ", "物", "word62", "いま", "今", "word63", "とき", "時", "word64", "ころ", "頃", "word65", "ま", "間", "word66", "まえ", "前", "word67", "あいだ", "間", "word68", "あと", "後", "word69", "きのう", "昨日", "word70", "きょう", "今日", "word71", "あした", "明日", "word71", "あす", "明日", "word72", "あさって", "明後日", "word73", "ヶ月", "か月", "word73", "ケ月", "か月", "word73", "カ月", "か月", "word74", "ほう", "方", "word75", "ところ", "所", "word76", "あたり", "辺り", "word77", "周り", "回り", "word77", "まわり", "回り", "word78", "まえ", "前", "word79", "なか", "中", "word80", "うしろ", "後ろ", "word81", "まん", "真ん", "word82", "つぎ", "次", "word83", "つづく", "続く", "word83", "つづい", "続い", "word83", "つづか", "続か", "word83", "つづき", "続き", "word83", "つづけ", "続け", "word83", "つづこ", "続こ", "word84", "でる", "出る", "word84", "でれ", "出れ", "word84", "でろ", "出ろ", "word84", "でよ", "出よ", "word85", "だす", "出す", "word85", "ださ", "出さ", "word85", "だし", "出し", "word85", "だせ", "出せ", "word85", "だそ", "出そ", "word86", "はいる", "入る", "word86", "はいっ", "入っ", "word86", "はいら", "入ら", "word86", "はいり", "入り", "word86", "はいれ", "入れ", "word86", "はいろ", "入ろ", "word87", "いれる", "入れる", "word87", "いれよ", "入れよ", "word87", "いれれ", "入れれ", "word87", "いれろ", "入れろ", "word88", "のうえ", "の上", "word89", "のとおり", "の通り", "word90", "のかぎり", "の限り", "word91", "ただし", "但し", "word92", "たとえば", "例えば", "word93", "たしかに", "確かに", "word94", "ぜひ", "是非", "word95", "ほど", "程", "word96", "くらい", "位", "word97", "ように", "様に", "word97", "ような", "様な", "word98", "ふうに", "風に", "word98", "ふうな", "風な", "word98", "ふうの", "風の", "word99", "じゅう", "中", "word100", "ぶん", "分", "word101", "たび", "度", "word102", "めったに", "滅多に", "word103", "まったく", "全く", "word104", "ひじょうに", "非常に", "word105", "とくに", "特に", "word106", "すべて", "全て", "word107", "もっとも", "最も", "word108", "おもに", "主に", "word108", "おもな", "主な", "word109", "じつは", "実は", "word110", "すでに", "既に", "word111", "つねに", "常に", "word112", "いちおう", "一応", "word113", "いっしょ", "一緒", "word114", "いったん", "一旦", "word115", "ずいぶん", "随分", "word116", "ぜんぜん", "全然", "word117", "だいたい", "大体", "word118", "たいてい", "大抵", "word119", "たいへん", "大変", "word120", "さまざま", "様々", "word121", "充分", "十分", "word121", "じゅうぶん", "十分", "word122", "たぶん", "多分", "word123", "ふつう", "普通", "word124", "堅", "硬", "word124", "固", "硬", "word124", "かた", "硬", "word125", "柔らか", "軟らか", "word125", "やわらか", "軟らか", "word126", "よく", "良く", "word126", "よかっ", "良かっ", "word126", "よかろ", "良かろ", "word126", "よけれ", "良けれ", "word127", "よい", "良い", "word127", "よし", "良し", "word128", "なかよし", "仲良し", "word129", "わたし", "私", "word129", "ワタシ", "私", "word130", "ぼく", "僕", "word130", "ボク", "僕", "word131", "おれ", "俺", "word131", "オレ", "俺", "word132", "きみ", "君", "word132", "キミ", "君", "word133", "おまえ", "お前", "word133", "オマエ", "お前", "word134", "かれ", "彼", "word134", "カレ", "彼", "word135", "かのじょ", "彼女", "word135", "カノジョ", "彼女", "word136", "われわれ", "我々", "word137", "わが", "我が", "word138", "やつ", "奴", "word138", "ヤツ", "奴", "word139", "だれ", "誰", "word139", "ダレ", "誰", "word140", "たち", "達", "word141", "１つ", "一つ", "word141", "ひとつ", "一つ", "word142", "１人", "一人", "word142", "ひとり", "一人", "word143", "いちどに", "一度に", "word144", "いちばん", "一番", "word145", "がいっぱい", "が一杯", "word146", "め", "目", "word147", "おこなう", "行う", "word147", "おこない", "行い", "word147", "おこなえ", "行え", "word147", "おこなお", "行お", "word147", "おこなっ", "行っ", "word147", "おこなわ", "行わ", "word148", "めざ", "目指", "word148", "めざし", "目指し", "word148", "めざさ", "目指さ", "word148", "めざせ", "目指せ", "word148", "めざそ", "目指そ", "word149", "がんば", "頑張", "word150", "かまわ", "構わ", "word151", "みな", "皆", "word151", "みんな", "皆", "word152", "わけ", "訳", "word153", "こと", "事", "word154", "すばらしい", "素晴らしい", "word155", "きみ", "気味"];

  const wordsValue2 = ["word1","しに行","しにい","word1","しに行き","しにいき","word1","しに行く","しにいく","word1","しに行け","しにいけ","word1","しに行こ","しにいこ","word1","しに行っ","しにいっ","word2","しに来","しにく","word3","して欲し","してほし","word4","し過ぎ","しすぎ","word5","し得る","しうる","word6","し合","しあ","word6","し合う","しあう","word6","し合え","しあえ","word6","し合お","しあお","word6","し合っ","しあっ","word6","し合わ","しあわ","word7","し出","しだ","word7","し出し","しだし","word7","し出さ","しださ","word7","し出せ","しだせ","word7","し出そ","しだそ","word7","し込ま","しこま","word8","し込","しこ","word8","し込む","しこむ","word8","し込め","しこめ","word8","し込も","しこも","word8","し込ん","しこん","word9","し切","しき","word9","し切ら","しきら","word9","し切り","しきり","word9","し切る","しきる","word9","し切れ","しきれ","word9","し切ろ","しきろ","word10","し付","しつ","word11","し取","しと","word12","し立","した","word13","起こ","おこ","word14","返さ","かえさ","word14","返し","かえし","word14","返す","かえす","word14","返せ","かえせ","word14","返そ","かえそ","word15","行か","いか","word15","行き","いき","word15","行く","いく","word15","行け","いけ","word15","行こ","いこ","word15","行っ","いっ","word16","来る","くる","word16","来れ","くれ","word16","来い","こい","word18","言い","いい","word18","言う","いう","word18","言え","いえ","word18","言お","いお","word18","言っ","いっ","word19","と言う","という","word19","と言え","といえ","word19","と言っ","といっ","word19","と言い","といい","word19","と言お","といお","word21","見","観","word21","診","観","word21","み","観","word22","見つけ","みつけ","word23","聞","訊","word23","聴","訊","word23","き","訊","word24","効か","きか","word24","効き","きき","word24","効く","きく","word24","効け","きけ","word24","効こ","きこ","word25","持た","もた","word25","持ち","もち","word25","持つ","もつ","word25","持っ","もっ","word25","持て","もて","word25","持と","もと","word26","済ま","すま","word26","済み","すみ","word26","済む","すむ","word26","済め","すめ","word26","済も","すも","word26","済ん","すん","word27","無い","ない","word27","無う","なう","word27","無かっ","なかっ","word27","無かろ","なかろ","word27","無く","なく","word27","無けれ","なけれ","word28","何","なに","word29","何の","なんの","word31","他","ほか","word33","初めて","はじめて","word34","始め","初め","word34","はじめ","初め","word35","始める","はじめる","word35","始めよ","はじめよ","word35","始めれ","はじめれ","word35","始めろ","はじめろ","word36","始まる","はじまる","word36","始まっ","はじまっ","word36","始まら","はじまら","word36","始まり","はじまり","word36","始まれ","はじまれ","word36","始まろ","はじまろ","word37","上がる","あがる","word37","上がら","あがら","word37","上がり","あがり","word37","上がれ","あがれ","word37","上がろ","あがろ","word37","上がっ","あがっ","word38","上げる","あげる","word38","上げ","あげ","word38","上げよ","あげよ","word38","上げれ","あげれ","word38","上げろ","あげろ","word39","出来上が","出来あが","word39","できあが","出来あが","word40","下さ","くださ","word41","大き","おおき","word42","小さ","ちいさ","word43","大いに","おおいに","word43","大いなる","おおいなる","word44","少し","すこし","word45","作ら","造ら","word45","作り","造り","word45","作る","造る","word45","作れ","造れ","word45","作ろ","造ろ","word45","作っ","造っ","word45","創ら","造ら","word45","創り","造り","word45","創る","造る","word45","創れ","造れ","word45","創ろ","造ろ","word45","創っ","造っ","word45","つくら","造ら","word45","つくり","造り","word45","つくる","造る","word45","つくれ","造れ","word45","つくろ","造ろ","word45","つくっ","造っ","word46","取ら","摂ら","word46","取り","摂り","word46","取る","摂る","word46","取れ","摂れ","word46","取ろ","摂ろ","word46","取っ","摂っ","word46","採ら","摂ら","word46","採り","摂り","word46","採る","摂る","word46","採れ","摂れ","word46","採ろ","摂ろ","word46","採っ","摂っ","word46","とら","摂ら","word46","とり","摂り","word46","とる","摂る","word46","とれ","摂れ","word46","とろ","摂ろ","word46","とっ","摂っ","word47","変え","替え","word47","代え","替え","word47","換え","替え","word47","かえ","替え","word48","測ら","計ら","word48","測り","計り","word48","測る","計る","word48","測れ","計れ","word48","測ろ","計ろ","word48","測っ","計っ","word48","量ら","計ら","word48","量り","計り","word48","量る","計る","word48","量れ","計れ","word48","量ろ","計ろ","word48","量っ","計っ","word48","はから","計ら","word48","はかり","計り","word48","はかる","計る","word48","はかれ","計れ","word48","はかろ","計ろ","word48","はかっ","計っ","word49","分から","判ら","word49","分かり","判り","word49","分かる","判る","word49","分かれ","判れ","word49","分かろ","判ろ","word49","分かっ","判っ","word49","解ら","判ら","word49","解り","判り","word49","解る","判る","word49","解れ","判れ","word49","解ろ","判ろ","word49","解っ","判っ","word49","わから","判ら","word49","わかり","判り","word49","わかる","判る","word49","わかれ","判れ","word49","わかろ","判ろ","word49","わかっ","判っ","word50","無駄","むだ","word50","ムダ","むだ","word51","無理","むり","word51","ムリ","むり","word52","馬鹿","ばか","word52","バカ","ばか","word53","変","へん","word53","ヘン","へん","word54","嫌","いや","word54","イヤ","いや","word55","我慢","がまん","word55","ガマン","がまん","word56","綺麗","きれい","word56","キレイ","きれい","word57","体","からだ","word57","カラダ","からだ","word58","不思議","ふしぎ","word58","フシギ","ふしぎ","word59","本当","ほんとう","word59","ホント","ほんとう","word60","簡単","かんたん","word60","カンタン","かんたん","word61","物","者","word61","もの","者","word61","モノ","者","word62","今","いま","word63","時","とき","word64","頃","ころ","word65","間","ま","word66","前","まえ","word67","間","あいだ","word68","後","あと","word69","昨日","きのう","word70","今日","きょう","word71","明日","あした","word71","あす","あした","word72","明後日","あさって","word73","か月","ヶ月","word73","ケ月","ヶ月","word73","カ月","ヶ月","word74","方","ほう","word75","所","ところ","word76","辺り","あたり","word77","回り","周り","word77","まわり","周り","word78","前","まえ","word79","中","なか","word80","後ろ","うしろ","word81","真ん","まん","word82","次","つぎ","word83","続く","つづく","word83","続い","つづい","word83","続か","つづか","word83","続き","つづき","word83","続け","つづけ","word83","続こ","つづこ","word84","出る","でる","word84","出れ","でれ","word84","出ろ","でろ","word84","出よ","でよ","word85","出す","だす","word85","出さ","ださ","word85","出し","だし","word85","出せ","だせ","word85","出そ","だそ","word86","入る","はいる","word86","入っ","はいっ","word86","入ら","はいら","word86","入り","はいり","word86","入れ","はいれ","word86","入ろ","はいろ","word87","入れる","いれる","word87","入れよ","いれよ","word87","入れれ","いれれ","word87","入れろ","いれろ","word88","の上","のうえ","word89","の通り","のとおり","word90","の限り","のかぎり","word91","但し","ただし","word92","例えば","たとえば","word93","確かに","たしかに","word94","是非","ぜひ","word95","程","ほど","word96","位","くらい","word97","様に","ように","word97","様な","ような","word98","風に","ふうに","word98","風な","ふうな","word98","風の","ふうの","word99","中","じゅう","word100","分","ぶん","word101","度","たび","word102","滅多に","めったに","word103","全く","まったく","word104","非常に","ひじょうに","word105","特に","とくに","word106","全て","すべて","word107","最も","もっとも","word108","主に","おもに","word108","主な","おもな","word109","実は","じつは","word110","既に","すでに","word111","常に","つねに","word112","一応","いちおう","word113","一緒","いっしょ","word114","一旦","いったん","word115","随分","ずいぶん","word116","全然","ぜんぜん","word117","大体","だいたい","word118","大抵","たいてい","word119","大変","たいへん","word120","様々","さまざま","word121","十分","充分","word121","じゅうぶん","充分","word122","多分","たぶん","word123","普通","ふつう","word124","硬","堅","word124","固","堅","word124","かた","堅","word125","軟らか","柔らか","word125","やわらか","柔らか","word126","良く","よく","word126","良かっ","よかっ","word126","良かろ","よかろ","word126","良けれ","よけれ","word127","良い","よい","word127","良し","よし","word128","仲良し","なかよし","word129","私","わたし","word129","ワタシ","わたし","word130","僕","ぼく","word130","ボク","ぼく","word131","俺","おれ","word131","オレ","おれ","word132","君","きみ","word132","キミ","きみ","word133","お前","おまえ","word133","オマエ","おまえ","word134","彼","かれ","word134","カレ","かれ","word135","彼女","かのじょ","word135","カノジョ","かのじょ","word136","我々","われわれ","word137","我が","わが","word138","奴","やつ","word138","ヤツ","やつ","word139","誰","だれ","word139","ダレ","だれ","word140","達","たち","word141","一つ","１つ","word141","ひとつ","１つ","word142","一人","１人","word142","ひとり","１人","word143","一度に","いちどに","word144","一番","いちばん","word145","が一杯","がいっぱい","word146","目","め","word147","行う","おこなう","word147","行い","おこない","word147","行え","おこなえ","word147","行お","おこなお","word147","行っ","おこなっ","word147","行わ","おこなわ","word148","目指","めざ","word148","目指し","めざし","word148","目指さ","めざさ","word148","目指せ","めざせ","word148","目指そ","めざそ","word149","頑張","がんば","word150","構わ","かまわ","word151","皆","みな","word151","みんな","みな","word152","訳","わけ","word153","事","こと","word154","素晴らしい","すばらしい","word155","気味","きみ"];

  const wordsValue3 = ["word21","見","診","word21","観","診","word21","み","診","word23","聞","聴","word23","訊","聴","word23","き","聴","word34","始め","はじめ","word34","初め","はじめ","word39","出来上が","できあが","word39","出来あが","できあが","word45","作ら","創ら","word45","作り","創り","word45","作る","創る","word45","作れ","創れ","word45","作ろ","創ろ","word45","作っ","創っ","word45","造ら","創ら","word45","造り","創り","word45","造る","創る","word45","造れ","創れ","word45","造ろ","創ろ","word45","造っ","創っ","word45","つくら","創ら","word45","つくり","創り","word45","つくる","創る","word45","つくれ","創れ","word45","つくろ","創ろ","word45","つくっ","創っ","word46","取ら","採ら","word46","取り","採り","word46","取る","採る","word46","取れ","採れ","word46","取ろ","採ろ","word46","取っ","採っ","word46","摂ら","採ら","word46","摂り","採り","word46","摂る","採る","word46","摂れ","採れ","word46","摂ろ","採ろ","word46","摂っ","採っ","word46","とら","採ら","word46","とり","採り","word46","とる","採る","word46","とれ","採れ","word46","とろ","採ろ","word46","とっ","採っ","word47","変え","代え","word47","替え","代え","word47","換え","代え","word47","かえ","代え","word48","測ら","量ら","word48","測り","量り","word48","測る","量る","word48","測れ","量れ","word48","測ろ","量ろ","word48","測っ","量っ","word48","計ら","量ら","word48","計り","量り","word48","計る","量る","word48","計れ","量れ","word48","計ろ","量ろ","word48","計っ","量っ","word48","はから","量ら","word48","はかり","量り","word48","はかる","量る","word48","はかれ","量れ","word48","はかろ","量ろ","word48","はかっ","量っ","word49","分から","解ら","word49","分かり","解り","word49","分かる","解る","word49","分かれ","解れ","word49","分かろ","解ろ","word49","分かっ","解っ","word49","判ら","解ら","word49","判り","解り","word49","判る","解る","word49","判れ","解れ","word49","判ろ","解ろ","word49","判っ","解っ","word49","わから","解ら","word49","わかり","解り","word49","わかる","解る","word49","わかれ","解れ","word49","わかろ","解ろ","word49","わかっ","解っ","word50","無駄","ムダ","word50","むだ","ムダ","word51","無理","ムリ","word51","むり","ムリ","word52","馬鹿","バカ","word52","ばか","バカ","word53","変","ヘン","word53","へん","ヘン","word54","嫌","イヤ","word54","いや","イヤ","word55","我慢","ガマン","word55","がまん","ガマン","word56","綺麗","キレイ","word56","きれい","キレイ","word57","体","カラダ","word57","からだ","カラダ","word58","不思議","フシギ","word58","ふしぎ","フシギ","word59","本当","ホント","word59","ほんとう","ホント","word60","簡単","カンタン","word60","かんたん","カンタン","word61","物","もの","word61","者","もの","word61","モノ","もの","word71","明日","あす","word71","あした","あす","word73","か月","ケ月","word73","ヶ月","ケ月","word73","カ月","ケ月","word77","回り","まわり","word77","周り","まわり","word121","十分","じゅうぶん","word121","充分","じゅうぶん","word124","硬","固","word124","堅","固","word124","かた","固","word125","軟らか","やわらか","word125","柔らか","やわらか","word129","私","ワタシ","word129","わたし","ワタシ","word130","僕","ボク","word130","ぼく","ボク","word131","俺","オレ","word131","おれ","オレ","word132","君","キミ","word132","きみ","キミ","word133","お前","オマエ","word133","おまえ","オマエ","word134","彼","カレ","word134","かれ","カレ","word135","彼女","カノジョ","word135","かのじょ","カノジョ","word138","奴","ヤツ","word138","やつ","ヤツ","word139","誰","ダレ","word139","だれ","ダレ","word141","一つ","ひとつ","word141","１つ","ひとつ","word142","一人","ひとり","word142","１人","ひとり","word151","皆","みんな","word151","みな","みんな"];

  const wordsValue4 = ["word21", "見", "み", "word21", "観", "み", "word21", "診", "み", "word23", "聞", "き", "word23", "訊", "き", "word23", "聴", "き", "word45", "作ら", "つくら", "word45", "作り", "つくり", "word45", "作る", "つくる", "word45", "作れ", "つくれ", "word45", "作ろ", "つくろ", "word45", "作っ", "つくっ", "word45", "造ら", "つくら", "word45", "造り", "つくり", "word45", "造る", "つくる", "word45", "造れ", "つくれ", "word45", "造ろ", "つくろ", "word45", "造っ", "つくっ", "word45", "創ら", "つくら", "word45", "創り", "つくり", "word45", "創る", "つくる", "word45", "創れ", "つくれ", "word45", "創ろ", "つくろ", "word45", "創っ", "つくっ", "word46", "取ら", "とら", "word46", "取り", "とり", "word46", "取る", "とる", "word46", "取れ", "とれ", "word46", "取ろ", "とろ", "word46", "取っ", "とっ", "word46", "摂ら", "とら", "word46", "摂り", "とり", "word46", "摂る", "とる", "word46", "摂れ", "とれ", "word46", "摂ろ", "とろ", "word46", "摂っ", "とっ", "word46", "採ら", "とら", "word46", "採り", "とり", "word46", "採る", "とる", "word46", "採れ", "とれ", "word46", "採ろ", "とろ", "word46", "採っ", "とっ", "word47", "変え", "換え", "word47", "替え", "換え", "word47", "代え", "換え", "word47", "かえ", "換え", "word48", "測ら", "はから", "word48", "測り", "はかり", "word48", "測る", "はかる", "word48", "測れ", "はかれ", "word48", "測ろ", "はかろ", "word48", "測っ", "はかっ", "word48", "計ら", "はから", "word48", "計り", "はかり", "word48", "計る", "はかる", "word48", "計れ", "はかれ", "word48", "計ろ", "はかろ", "word48", "計っ", "はかっ", "word48", "量ら", "はから", "word48", "量り", "はかり", "word48", "量る", "はかる", "word48", "量れ", "はかれ", "word48", "量ろ", "はかろ", "word48", "量っ", "はかっ", "word49", "分から", "わから", "word49", "分かり", "わかり", "word49", "分かる", "わかる", "word49", "分かれ", "わかれ", "word49", "分かろ", "わかろ", "word49", "分かっ", "わかっ", "word49", "判ら", "わから", "word49", "判り", "わかり", "word49", "判る", "わかる", "word49", "判れ", "わかれ", "word49", "判ろ", "わかろ", "word49", "判っ", "わかっ", "word49", "解ら", "わから", "word49", "解り", "わかり", "word49", "解る", "わかる", "word49", "解れ", "わかれ", "word49", "解ろ", "わかろ", "word49", "解っ", "わかっ", "word61", "物", "モノ", "word61", "者", "モノ", "word61", "もの", "モノ", "word73", "か月", "カ月", "word73", "ヶ月", "カ月", "word73", "ケ月", "カ月", "word124", "硬", "かた", "word124", "堅", "かた", "word124", "固", "かた"];

  const wordsValue5 = ["word47", "変え", "かえ", "word47", "替え", "かえ", "word47", "代え", "かえ", "word47", "換え", "かえ"];

  let wordsCSV = "";




  // クリックしてキャンセル可能にする
  const radioButtons = document.querySelectorAll('input[type="radio"]');
  const clearRadioButton = (radioButton) => {
    setTimeout(func = () => {
      radioButton.checked = false;
    }, 100)
  }

  radioButtons.forEach(radioButton => {
    radioButton.addEventListener("mouseup", func = () => {
      if (radioButton.checked) {
        clearRadioButton(radioButton)
      }
    });
  });


  //リスト作成ボタンの機能
  document.querySelector('#listGenerate').addEventListener('click', () => {

    let theWord = [];
    let theValue = [];
    let textRed = [];
    let textBlue = [];
    let textGreen = [];
    let textGreen2 = [];
    wordsCSV = "";

    //ユーザーの選択を取得する
    for (let i = 1; i < 156; i++) {
      theWord[i] = `word${i}`;
      theValue[i] = getWordValue(`word${i}`);

      switch (theValue[i]) {
        case "0":
          for (let j = 0; j < 469; j = j + 1) {
            if (theWord[i] === wordsValue0[j]) {
              textGreen.push(wordsValue0[j + 1]);
              textGreen2.push(wordsValue0[j + 2]);
            }
          }
          break;
        case "1":
          for (let j = 0; j < 1144; j = j + 3) {
            if (theWord[i] === wordsValue1[j]) {
              textRed.push(wordsValue1[j + 1]);
              textBlue.push(wordsValue1[j + 2]);
            }
          }
          break;
        case "2":
          for (let j = 0; j < 1132; j = j + 3) {
            if (theWord[i] === wordsValue2[j]) {
              textRed.push(wordsValue2[j + 1]);
              textBlue.push(wordsValue2[j + 2]);
            }
          }
          break;
        case "3":
          for (let j = 0; j < 445; j = j + 3) {
            if (theWord[i] === wordsValue3[j]) {
              textRed.push(wordsValue3[j + 1]);
              textBlue.push(wordsValue3[j + 2]);
            }
          }
          break;
        case "4":
          for (let j = 0; j < 271; j = j + 3) {
            if (theWord[i] === wordsValue4[j]) {
              textRed.push(wordsValue4[j + 1]);
              textBlue.push(wordsValue4[j + 2]);
            }
          }
          break;
        case "5":
          for (let j = 0; j < 10; j = j + 3) {
            if (theWord[i] === wordsValue5[j]) {
              textRed.push(wordsValue5[j + 1]);
              textBlue.push(wordsValue5[j + 2]);
            }
          }
          break;
        default:
      }
    }

    // console.log("textRed,textBlue", textRed.length, textBlue.length);
    // console.log(textRed, textBlue);


    //表を作る
    const tateList = document.getElementById("checkWordList");
    tateList.textContent = "";
    displayTateList();



    //縦型リストの作成
    function displayTateList() {
      const tateTable = document.createElement("table");
      const tatethead = document.createElement("thead");
      const tatetbody = document.createElement("tbody");
      const tatetd1 = document.createElement("th");
      const tatetd2 = document.createElement("th");
      const tatetd3 = document.createElement("th");
      const tatetd4 = document.createElement("th");


      tatetd1.textContent = "修正検討ワード";
      tatetd2.textContent = "表記揃えワード";
      tatetd3.textContent = "要検討ワード";
      tatetd4.textContent = "要検討ワードの注記";

      tatethead.appendChild(tatetd1);
      tatethead.appendChild(tatetd2);
      tatethead.appendChild(tatetd3);
      tatethead.appendChild(tatetd4);

      tateTable.appendChild(tatethead);
      tateList.appendChild(tateTable);

      wordsCSV = "修正検討ワード,表記揃えワード,要検討ワード,要検討ワードの注記"+"\n";

      //2行目以降を入れる
      let redLength = textRed.length;
      let blueLength = textBlue.length;
      let greenLength = textGreen.length;
      let green2Length = textGreen2.length;
      const maxLength = Math.max(redLength, blueLength, greenLength, green2Length);

      while (redLength < maxLength) {
        textRed.push("");
        redLength = redLength + 1;
      }

      while (blueLength < maxLength) {
        textBlue.push("");
        blueLength = blueLength + 1;
      }

      while (greenLength < maxLength) {
        textGreen.push("");
        greenLength = greenLength + 1;
      }

      while (green2Length < maxLength) {
        textGreen2.push("");
        green2Length = green2Length + 1;
      }

      for (let i = 1; i < maxLength; i++) {
        const row = document.createElement("tr");
        const cellText1 = document.createElement("td");
        const cellText2 = document.createElement("td");
        const cellText3 = document.createElement("td");
        const cellText4 = document.createElement("td");

        //第1列
        cellText1.innerHTML = textRed[i];
        row.appendChild(cellText1);
        wordsCSV = wordsCSV + textRed[i] + ",";

        //第2列
        cellText2.innerHTML = textBlue[i];
        row.appendChild(cellText2);
        wordsCSV = wordsCSV + textBlue[i] + ",";

        //第3列
        cellText3.innerHTML = textGreen[i];
        row.appendChild(cellText3);
        wordsCSV = wordsCSV + textGreen[i] + ",";

        //第4列
        cellText4.innerHTML = textGreen2[i];
        row.appendChild(cellText4);
        wordsCSV = wordsCSV + textGreen2[i] + "\n";

        tatetbody.appendChild(row);
        tateTable.appendChild(tatetbody);
        tateList.appendChild(tateTable);
      }
    }



  })

  //valueを取得する
  function getWordValue(word) {
    const wordV = document.querySelector(`input[name="${word}"]:checked`)
    const wordValue = wordV ? wordV.value : "0";
    return wordValue;
  }

  //リストを外部出力する
  document.querySelector('#saveList').addEventListener('click', () => {
    const bom = new Uint8Array([0xef, 0xbb, 0xbf]) //ここでUTF-8を指定
    const blob = new Blob([bom, wordsCSV], { type: "text/csv" });
    const url = URL.createObjectURL(blob);
    const a = document.createElement("a");
    a.href = url;
    a.download = "My表記統一ワードリスト.csv";
    a.click();
    URL.revokeObjectURL(url);
  });


  //アコーディオンメニュー
  document.addEventListener("DOMContentLoaded", () => {
    const title = document.querySelectorAll('.js-accordion-title');
    for (let i = 0; i < title.length; i++) {
      let titleEach = title[i];
      let content = titleEach.nextElementSibling;
      titleEach.addEventListener('click', () => {
        titleEach.classList.toggle('is-active');
        content.classList.toggle('is-open');
      });
    }
  });




  //クレジット
  // document.querySelector('.qqq').addEventListener('click', () => {
  //   const qualityCenter = document.getElementById("qualityCenter");
  //   qualityCenter.style.display = "flex";
  // });

  // document.querySelector('#qualityCenter').addEventListener('click', () => {
  //   const qualityCenter = document.getElementById("qualityCenter");
  //   qualityCenter.style.display = "none";
  // });


}